## 데이터 준비

In [1]:
import pandas as pd
import numpy as np

In [26]:
A_salary   = pd.Series([25, 28, 50, 60, 30, 35, 40, 70, 40, 70, 40, 100, 30, 30 ])
B_salary   = pd.Series([20, 40, 25, 25, 35, 25 ,20, 10, 55, 65, 100, 100, 150, 300])

In [6]:
df = pd.DataFrame ( {'A_salary': A_salary,
                     'B_salary' :B_salary  }
)

df

    A_salary  B_salary
0         25        20
1         28        40
2         50        25
3         60        25
4         30        35
5         35        25
6         40        20
7         70        10
8         40        55
9         70        65
10        40       100
11       100       100
12        30       150
13        30       300

## 대푯값 탐색

#### 평균 - mean()

In [7]:
print("A 기업 연봉평균", A_salary.mean() , "  B 기업 연봉평균 ", B_salary.mean() )

A 기업 연봉평균 46.285714285714285   B 기업 연봉평균  69.28571428571429

In [10]:
print(f"mean으로 계산: {A_salary.mean()}")
print(f"직접 계산: {A_salary.sum()/A_salary.count()}")

mean으로 계산: 46.285714285714285
직접 계산: 46.285714285714285

In [13]:
df.mean(axis=0)  #열별 평균

A_salary    46.285714
B_salary    69.285714
dtype: float64

In [14]:
A_salary  = pd.Series([np.nan , 25, 28, 50, 60, 30, 35, 40, 70, 40, 70, 40, 100, 30, 30 ])

In [15]:
A_salary.mean( skipna=True )  #열별 평균 .  결측치 제외

46.285714285714285

#### 중앙값 - median()

In [16]:
A_salary   = pd.Series([25, 28, 50, 60, 30, 35, 40, 70, 40, 70, 40, 100, 30, 30 ])
B_salary   = pd.Series([20, 40, 25, 25, 35, 25 ,20, 10, 55, 65, 100, 100, 150, 300])

In [17]:
print("A 기업 연봉 중앙값 ",  A_salary.median()  , "   B 기업 연봉 중앙값 ", B_salary.median()  )

A 기업 연봉 중앙값  40.0    B 기업 연봉 중앙값  37.5

In [18]:
df.median(axis=0)  #열별 중앙값

A_salary    40.0
B_salary    37.5
dtype: float64

## 분산도 탐색

#### 범위 : 최대값 -  최소값

In [19]:
A_salary.max() - A_salary.min()

75

In [20]:
B_salary.max() - B_salary.min()

290

#### 분산  var(),    표준편차  std()

In [21]:
A_salary.std()

21.556468140243165

In [22]:
A_salary.var()

464.68131868131866

In [23]:
B_salary.std()

77.53056823594814

In [24]:
B_salary.var()

6010.989010989011